// Задача 1. Дано масив рядків. Вивести ті, у яких є цифри (використати метод test та регулярні вирази).
if (confirm('Почати тестування?')) {
    window.onload = function () {
        const data = [
            "Привіт123",                  // є цифри
            "Hello",                      // без цифр, без голосних (якщо дивитись тільки українські)
            "Море",                       // є голосні
            "Кврт",                       // без голосних
            "Тест1",                      // є 1
            "Мрія3",                      // є 3
            "У тексті є числа 12 і 345",  // для завдання 6 і 10
            "Пунктуація: крапка, кома; знак!", // для завдання 7 і 8
            "Дата народження 09.10.2025", // формат дати
            "У 2021 і 2045 було важливо", // роки 2020–2049
            "Номер картки 4142-3433-2323-3434", // банківська картка
            "4142343323233434",           // картка без дефісів
            "https://company.gov.ua",     // урядовий сайт
            "https://example.com",        // не урядовий сайт
            "+380672345678",              // Київстар
            "+380931234567",              // не Київстар
            "Іванов Іван",            // для заміни пробілу
            "09.10.2025"                  // для формату дата → місяць/рік
        ];
        document.write(`<h3>Задача 1. Дано масив рядків. Вивести ті, у яких є цифри (використати метод test та регулярні вирази).</h3>`)

        const res1 = data.filter(str => /[0-9]/.test(str))
        document.write(`${res1.map(str => `${str} <br>`).join(" ")}`)
        // Задача 2. Дано масив рядків. Вивести ті, у яких немає цифр.
        document.write(` <h3 > Задача 2. Дано масив рядків.Вивести ті, у яких немає цифр. </h3 >`)

        const res2 = data.filter(str => !/[0-9]/.test(str))
        document.write(`${res2.map(str => `${str} <br>`).join(" ")}`)

        // Задача 3. Дано масив рядків. Вивести ті, у яких є голосні літери.
        document.write(` <h3 > Задача 3. Дано масив рядків. Вивести ті, у яких є голосні літери. </h3 >`)
        const res3 = data.filter(str => /[аоуеюиєі]/i.test(str))
        document.write(`${res3.map(str => `${str} <br>`).join(" ")}`)


        // Задача 4. Дано масив рядків. Вивести ті, у яких немає голосних літер.
        document.write(` <h3 > Задача 4. Дано масив рядків. Вивести ті, у яких немає голосних літер. </h3 >`)
        const res4 = data.filter(str => !/[аоуеюиєі]/i.test(str))
        document.write(`${res4.map(str => `${str} <br>`).join(" ")}`)
        // Задача 5. Дано масив рядків. Вивести ті, у яких є або цифра 1 або цифра 3.
        document.write(` <h3 > Задача 5. Дано масив рядків. Вивести ті, у яких є або цифра 1 або цифра 3. </h3 >`)
        const res5 = data.filter(str => /[31]/.test(str))
        document.write(`${res5.map(str => `${str} <br>`).join(" ")}`)
        // Задача 6. Дано рядок тексту, вивести усі числа, які є у тексті.
        document.write(`<h3>Задача 6. Дано рядок тексту, вивести усі числа, які є у тексті.</h3>`)
        const text6 = "У тексті є числа 12 і 345"
        const numbers6 = text6.match(/\d+/g)
        if (numbers6) document.write(` ${numbers6}`)
        else document.write(`Чисел не знайдено`)


        // Задача 7. Дано рядок тексту. Знайти усі знаки пунктуації, які були використано.
        document.write(`<h3>Задача 7. Дано рядок тексту. Знайти усі знаки пунктуації, які були використано.</h3>`)
        const text7 = "Punctuation: period, comma; mark!"
        const marks = text7.match(/\W/g)
        if (marks) document.write(` ${marks}`)
        else document.write(`Знаків пунктуації не знайдено`)
        // Задача 8. Дано рядок тексту. Вивести усі складові, які розділені розділовими знаками.
        document.write(`<h3>Задача 8. Дано рядок тексту. Вивести усі складові, які розділені розділовими знаками.</h3>`);
        const text8 = "Punctuation: period, comma; mark!";
        const parts = text8.split(/[.,;:!?]+/);
        const trimmed = parts.map(part => part.trim());
        const cleanParts = trimmed.filter(Boolean);

        if (cleanParts.length > 0) {
            document.write(cleanParts.join("<br>"));
        } else {
            document.write("Складові не знайдено");
        }
        // Задача 9. Дано рядок тексту. Перевірити, чи містить він дату у форматі dd.mm.yyyy (dd- день, mm- місяць, yyyy- рік).
        document.write(`<h3>Задача 9. Дано рядок тексту. Перевірити, чи містить він дату у форматі dd.mm.yyyy (dd- день, mm- місяць, yyyy- рік).</h3>`);
        const date = "Дата народження 09.10.2025"
        if (/\d{2}\.\d{2}\.\d{4}/.test(date)) document.write(`містить`)
        else document.write(`не містить`)


        // Задача 10. Дано рядок тексту. Підрахувати кількість двоцифрових чисел у рядку.
        document.write(`<h3>Задача 10. Дано рядок тексту. Підрахувати кількість двоцифрових чисел у рядку.</h3>`);
        const text10 = "У тексті є числа 12 і 345 а також 34 і 21"
        const res10 = text10.match(/\b\d{2}\b/g)
        if (res10) document.write(` Числа: ${res10} Кількість:${res10.length}`)
        else document.write(`Чисел не знайдено`)


        // Задача 11. Визначити чи може бути рядок тексту номером банківської картки (приклад: «4142-3433-2323-3434» ). Знайти усі такі номери (при цьому символи “-” можуть бути, а можуть і не бути, тобто так «4142343323233434».
        document.write(`<h3> Задача 11. Визначити чи може бути рядок тексту номером банківської картки (приклад: «4142-3433-2323-3434» ). Знайти усі такі номери (при цьому символи “-” можуть бути, а можуть і не бути, тобто так «4142343323233434»</h3>`);
        const text11 = " 4142-3433-2323-3434"
        const res11 = /\b(\d{4}-\d{4}-\d{4}-\d{4}|\d{16}\b)/.test(text11)
        if (res11) document.write(`може`)
        else document.write(`не може`)


        // Задача 12. Дано адресу сайту. Визначити, чи є він урядовим (містить домен “gov”, але не обов”язково у кінці). Наприклад: “https://company.gov.ua”
        document.write(`<h3> Задача 12. Дано адресу сайту. Визначити, чи є він урядовим (містить домен “gov”, але не обов”язково у кінці). Наприклад: “https://company.gov.ua”</h3>`);
        const text12 = "https://company.gov.ua"
        const res12 = /\.gov\b/.test(text12)
        if (res12) document.write(`може`)
        else document.write(`не може`)
        // Задача 13. Вибрати усі роки між 2020 та 2049 з отриманого повідомлення
        document.write(`<h3> Задача 13. Вибрати усі роки між 2020 та 2049 з отриманого повідомлення</h3>`);
        const text13 = "2013 2021 2023 2025 2022 2050 роки"
        const years = text13.match(/20(2[0-9]|3[0-9]|4[0-9])/g)
        document.write(`${years}`)

        // Задача 14. Дано номер телефону. Перевірити, чи є цей телефон телефоном оператора Киїівстар
        document.write(`<h3>Задача 14. Дано номер телефону. Перевірити, чи є цей телефон телефоном оператора Киїівстар</h3>`);
        const number = "+380672345678"
        const res14 = /^\+380(67|68|77|96|98)/.test(number)
        if (res14) document.write(`є`)
        else document.write(`не є`)

        // Задача 15. Користувач вводить прізвище та ім’я в одному рядку через пробіл.  Замінити пробіл на дефіс.
        document.write(`<h3>Задача 15. Користувач вводить прізвище та ім’я в одному рядку через пробіл.  Замінити пробіл на дефіс.</h3>`);
        let userName = prompt("Прізвище ім'я")
        userName = userName.split(" ")
        document.write(`${userName.join('-')}`)

        // Задача 16. Користувач вводить дату у форматі «день.місяць.рік». Отримати рядкове представлення дати у форматі «місяць/рік»
        document.write(`<h3>Задача 16. Користувач вводить дату у форматі «день.місяць.рік». Отримати рядкове представлення дати у форматі «місяць/рік».</h3>`);
        const userDate = prompt("введіть дату у форматі «день.місяць.рік»")
        const partsArr = userDate.split(".")
        document.write(`${partsArr[1]}/${partsArr[2]}`)
    }
}