// 1. Користувач вводить кількість елементів. Створити масив, що складається з вказаної кількості елементів заповнених нулями.
if (confirm('Почати тестування?')) {
    document.write(`<h1>1. Користувач вводить кількість елементів. Створити масив, що складається з вказаної кількості елементів заповнених нулями.</h1>`)

    const numberOfEl = parseInt(prompt('кількість елементів', '2'))
    const array = new Array(numberOfEl).fill(0)
    document.write(`array: ${array}`)
    document.write(`
    <br></br>
    <a href="./index.html">назад</a>`)
}