// 3. Користувач вводить кількість елементів. Створити масив, у якому перші 5 елементів заповнені 1-цями, а інші до кінця масиву заповнені 7-ками.
if (confirm('Почати тестування?')) {
    document.write(`<h1>3. Користувач вводить кількість елементів. Створити масив, у якому перші 5 елементів заповнені 1-цями, а інші до кінця масиву заповнені 7-ками.</h1>`)

    const numberOfEl = parseInt(prompt('кількість елементів', '2'))
    const array = new Array(numberOfEl).fill(1, 0, 5).fill(7, 5)
    document.write(`array: ${array}`)
    document.write(`
    <br></br>
    <a href="./index.html">назад</a>`)
}