// Задача 5. Дано кількість секунд, що пройшла від початку доби. Визначити скільки це годин і хвилин.
const seconds = parseFloat(prompt("Вкажіть кількість секунд, що пройшла від початку доби ", "2178"))
const hours = parseInt(seconds / 3600)
const minutes = parseInt(seconds % 3600 / 60)
document.write(`
   <h1> Задача 5. Дано кількість секунд, що пройшла від початку доби. Визначити скільки це годин і хвилин.</h1>
   Задана кількість секунд: ${seconds}
     <br></br>
   Пройшло  ${hours} годин ${minutes} хвилин
     <br></br>
    <a href="./index.html">назад</a>`)