// 5. На екрані виводиться меню: 
// 1. Сказати «Привіт». 
// 2. Сказати «Зачекай». 
// 3. Сказати «До побачення». 
// 4. Вихід.
// Шляхом вибору пунктів меню виводити відповідні повідомлення, поки не буде вибрано пункт номер 4.
if (confirm('Почати тестування?')) {
    document.write(`<h1> На екрані виводиться меню: 
 1. Сказати «Привіт». 
 2. Сказати «Зачекай». 
 3. Сказати «До побачення». 
 4. Вихід.
 Шляхом вибору пунктів меню виводити відповідні повідомлення, поки не буде вибрано пункт номер 4.</h1>`)

    let number
    let answer
    do {
        number = parseInt(prompt(' 1. Сказати «Привіт». \n 2. Сказати «Зачекай». \n 3. Сказати «До побачення». \n 4. Вихід.', ''))
        switch (number) {
            case 1:
                answer = 'Привіт'
                break;
            case 2:
                answer = 'Зачекай'
                break;
            case 3:
                answer = 'До побачення'
                break;
            case 4:
                answer = 'Виходимо з програми'
                break;
            default:
                answer = 'Такого пункту меню не існує'
                break;
        }
        alert(`${answer} `)

    } while (number !== 4)
    document.write(`
    <br></br>
    <a href="./index.html">назад</a>`)
}

