"use strict";
// Задача 5.  З використанням замикань розробити ітератор, тобто функцію, що буде поступово за окремими викликами видавати по одне значення від заданого мінімального до заданого максимального. Якщо значення досягне максимального, то наступним буде мінімальне значення. З використанням цієї функції реалізувати перебір номерів місяців. 
document.write(`<h1>Задача 5.  З використанням замикань розробити ітератор, тобто функцію, що буде поступово за окремими викликами видавати по одне значення від заданого мінімального до заданого максимального. Якщо значення досягне максимального, то наступним буде мінімальне значення. З використанням цієї функції реалізувати перебір номерів місяців. </h1>`);
if (confirm('Почати тестування?')) {
    function externalFunc(min, max) {
        let num = min - 1;
        function internalFunc() {
            if (num < max) {
                num++;
            }
            else
                num = min;
            return num;
        }
        return internalFunc;
    }
    const monthNames = ["Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень", "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень",];
    let monthNum = externalFunc(1, 12);
    for (let index = 0; index < 15; index++) {
        document.write(`Місяць №: ${monthNum()} - ${monthNames[index % 12]}<br>`);
    }
    document.write(`
    <br></br>
    <a href="./index.html">назад</a>`);
}
