// Знайти суму всіх непарних чисел, що знаходяться між заданими користувачем числами. 
if (confirm('Почати тестування?')) {
    document.write(`<h1>Знайти суму всіх непарних чисел, що знаходяться між заданими користувачем числами. </h1>`)

    const minNum = parseInt(prompt('Вкажіть мінімальне число діапазону', '1'))
    const maxNum = parseInt(prompt('Вкажіть максимальне число діапазону', '3'))
    let sum = 0
    for (let i = minNum + 1; i < maxNum; i++) {
        if (i % 2 !== 0) {
            sum += i
        }

    }
    if (sum === 0) {
        document.write(`Між заданими вами числами відсутні непарні числа`)

    }
    else {
        document.write(`Сума непарних чисел що знаходяться між заданими числами (${minNum}-${maxNum}): ${sum}`)
    }
    document.write(`
    <br></br>
    <a href="./index.html">назад</a>`)
}
